# INTRODUCCION A PANDAS Y NUMPY

# Tipos de datos

In [13]:
type(1)

int

In [14]:
type("hola mundo")

str

In [15]:
type(0.2)

float

In [16]:
type(True)

bool

In [17]:
type('x')

str

# Variables

In [20]:
print("hello word".upper())
print("hello word".lower())
print("hello word".title())

HELLO WORD
hello word
Hello Word

In [21]:
"hello word".count('l')

2

In [33]:
message_1="Estoy aprendiendo python "

In [22]:
"hello word".replace('o','u')

'hellu wurd'

In [24]:
message_1

'Estoy aprendiendo python'

In [26]:
"I'm learning python"

"I'm learning python"

In [27]:
message_2="y es divertido"

In [28]:
message_2

'y es divertido'

In [34]:
message_1 + message_2

'Estoy aprendiendo python y es divertido'

In [35]:
f'Estoy aprendiendo Python'

'Estoy aprendiendo Python'

In [38]:
f'{message_1}{message_2}'

'Estoy aprendiendo python y es divertido'

# Listas

In [41]:
countries = ['United States','India','China','Brazil']

In [40]:
 countries[0]

'United States'

In [42]:
countries[0]

'United States'

In [43]:
countries[3]

'Brazil'

In [44]:
countries[-1]

'Brazil'

In [45]:
countries[-4]

'United States'

# Rebanada / Slicing

## Acceder a rebanadas de la lista; stop es excluyente asi que se deberia escribir el indice deseado mas uno.

### nombre_lista[start:stop]

In [47]:
countries[0:3]

['United States', 'India', 'China']

###  Si se omite el ultimo numero python nos va a debolver todo

In [48]:
countries[1:]

['India', 'China', 'Brazil']

In [49]:
countries[0:2]

['United States', 'India']

### desde el primer elemento hasta el deseado

In [50]:
countries[:2]

['United States', 'India']

# Operaciones y metodos con listas

## Añadir un elemento a una lista

In [51]:
countries.append('Canada')

In [52]:
countries

['United States', 'India', 'China', 'Brazil', 'Canada']

### insert(posicion,'dato')

In [53]:
countries.insert(0,'Argentina')

In [54]:
countries

['Argentina', 'United States', 'India', 'China', 'Brazil', 'Canada']

#### Concatenas Dos listas

In [55]:
countries_2 = ['Uk','Alemania','Australia']

In [56]:
countries + countries_2

['Argentina',
 'United States',
 'India',
 'China',
 'Brazil',
 'Canada',
 'Uk',
 'Alemania',
 'Australia']

###  Listas anidadas

In [57]:
nueva_lista = [countries,countries_2]

In [58]:
nueva_lista

[['Argentina', 'United States', 'India', 'China', 'Brazil', 'Canada'],
 ['Uk', 'Alemania', 'Australia']]

### Eliminar elementos de una lista

#### Metodo  .remove()

In [59]:
countries.remove('Canada')

In [60]:
countries

['Argentina', 'United States', 'India', 'China', 'Brazil']

#### Metodo    .pop() // solo admite el index del elemento a eliminar

In [61]:
countries.pop(0)

'Argentina'

In [62]:
countries

['United States', 'India', 'China', 'Brazil']

#### metodo del nombreLista[0]

In [63]:
del countries[0]

In [64]:
countries

['India', 'China', 'Brazil']

### Ordenar listas

In [65]:
numbers = [4,3,10,7,1,2]

In [66]:
numbers

[4, 3, 10, 7, 1, 2]

In [67]:
numbers.sort()

In [68]:
numbers

[1, 2, 3, 4, 7, 10]

In [69]:
numbers.sort(reverse=True)

In [70]:
numbers

[10, 7, 4, 3, 2, 1]

### Actualizar valores de una lista

In [71]:
numbers[0]

10

In [72]:
numbers[0] = 1000

In [73]:
numbers

[1000, 7, 4, 3, 2, 1]

### Copiar una lista

In [75]:
listaCopiada = countries.copy()

In [76]:
listaCopiada

['India', 'China', 'Brazil']

#### metodo con slicing

In [77]:
listaCopiada2 = countries[:]

In [78]:
listaCopiada2

['India', 'China', 'Brazil']

# Diccionarios

In [79]:
mi_diccionario = {'key1':'value1','key2':'value2'}

In [80]:
my_data = {'nombre':'Frank','edad':24}

In [81]:
my_data

{'nombre': 'Frank', 'edad': 24}

In [82]:
my_data['nombre']

'Frank'

In [83]:
my_data['edad']

24

####  debolver todas las llaves

In [84]:
my_data.keys()

dict_keys(['nombre', 'edad'])

#### Devolver todo los valores

In [85]:
my_data.values()

dict_values(['Frank', 24])

#### devolver par llave valor

In [86]:
my_data.items()

dict_items([('nombre', 'Frank'), ('edad', 24)])

#### Agregar / actualizar elementos

In [87]:
my_data = {'nombre':'frank','edad':25}

In [88]:
my_data['estatura'] = 1.4

In [89]:
my_data

{'nombre': 'frank', 'edad': 25, 'estatura': 1.4}

#### usando el metodo  nombreDiccionario.update( {' llave ' : valor ,' llave ' : valor} )

In [91]:
my_data.update({'estatura':2,'lenguages':['Ingles','Spanish']})

In [92]:
my_data

{'nombre': 'frank',
 'edad': 25,
 'estatura': 2,
 'lenguages': ['Ingles', 'Spanish']}

### Copiar un diccionario

In [93]:
nuevo = my_data.copy()

In [94]:
nuevo

{'nombre': 'frank',
 'edad': 25,
 'estatura': 2,
 'lenguages': ['Ingles', 'Spanish']}

###  Eliminar elementos
    nombreDiccionario.pop('llave')

In [95]:
my_data.pop('estatura')

2

In [99]:
my_data

{'nombre': 'frank', 'edad': 25}

#### con el metodo del nombDicc[ 'llave' ]

In [98]:
del my_data['lenguages']

#### Eliminar todo los items de un diccionario

In [102]:
my_data.clear()

In [103]:
my_data

{}

# For

In [111]:
for pais in countries:
    if pais == "China":
        print("si existe el pais")
    else:
        print("No existe el pais")

No existe el pais
si existe el pais
No existe el pais

####  Enumerar los elementos de la iteracion

In [113]:
for numero, pais in enumerate(countries):
    print(numero,pais)

0 India
1 China
2 Brazil

#### Bucle for en diccionario

In [114]:
my_data = {'nombre':'Frank','edad':24}

In [116]:
for llave, valor in my_data.items():
    print(llave,valor)

nombre Frank
edad 24

## FUNCIONES

##### Funciones pre-fabricadas

#### len( )  vota el tamaño de un iterable ( listas o diccionarios )

In [117]:
len(countries)

3

#### max()    min()

In [118]:
min([3,4])

3

In [120]:
max([14,2])

14

####  type()  tipo de dato

In [121]:
type(my_data)

dict

#### round(valor a redondear, decimales)  redondea un decimal

In [122]:
round(3.4444,2)

3.44

####  range(inicio, fin, incremento) vota secuencia de numeros

In [124]:
for i in range(1,10,2):
    print(i)

1
3
5
7
9

### crear funciones

#### def function( params ):
        code
        return data

In [125]:
def sumar(a,b):
    sumaNumeros = a + b
    return sumaNumeros

In [127]:
sumar(2,3)

5

## Modulos

In [128]:
import os

In [129]:
os.getcwd()

'C:\\Users\\USUARIO\\Documents\\JupiterNotebook'

In [132]:
os.listdir()

['.ipynb_checkpoints', 'Ejemplo.ipynb', 'nueva carpeta']

#### crear nueva carpeta

In [131]:
os.makedirs("nueva carpeta")

#  Pandas

####  Series es un array de una dimension, Dataframe es un array de dos dimensiones

####  Dataframes estan compuestas por filas/ row , index, Series, columnas

## Creando Dataframes

In [137]:
import numpy as np

In [138]:
np.array([[1,2],[1,3],[4,3]])

array([[1, 2],
       [1, 3],
       [4, 3]])

In [139]:
data = [[1,2],[1,3],[4,3]]

In [140]:
data

[[1, 2], [1, 3], [4, 3]]

####  crear dataframe con diccionario
    my_dict={'NombColumna':'valores','NombColumna2':'valores'}

#### Tamb se puede crear dataframe con archivos csv y con pandas accedemos a ella

#### Creando dataframe usando arrays

In [141]:
import pandas as pd

In [142]:
import numpy as np

# Creando dataframe usando array

#### OPCION 1

#####  # Creando un array

In [143]:
data = np.array([[1,3],[2,5],[3,4]])

#####  # Creando un dataframe

In [147]:
df = pd.DataFrame(data, index=['row1','row2','row3'],
            columns=['col1','col2'])

#### # Mostrarndo el dataframe

In [148]:
df

      col1  col2
row1     1     3
row2     2     5
row3     3     4

#### OPCION 2

####  # creando un array en forma de lista

In [149]:
data = [[1,3],[2,5],[3,4]]

#### # creando dataframe

In [150]:
df = pd.DataFrame(data, index=['row1','row2','row3'],
            columns=['col1','col2'])

#### # mostrando el dataframe

In [151]:
df

      col1  col2
row1     1     3
row2     2     5
row3     3     4

# Creando dataframe usando diccionarios

#### # listas usadas para el ejemplo

In [152]:
states = ['California','Texas','Florida','New York']
population = [3232323,211212112,32432,3232321]

#### # Almacenando listas en un diccionario

In [153]:
dict_states = {'States':states, 'Population':population}

#### # creando dataframe

In [155]:
df_population = pd.DataFrame(dict_states)

#### # mostrando el dataframe

In [156]:
df_population

       States  Population
0  California     3232323
1       Texas   211212112
2     Florida       32432
3    New York     3232321

## Creando dataframe con archivos csv

#### # leyendo el archivo csv

In [157]:
df = pd.read_csv('StudentsPerformance.csv')

#### # mostrando el dataframe

In [158]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

#  Diferentes formas para mostrar un dataframe

In [159]:
import pandas as pd

#### # leyendo el archivo cvs

In [161]:
df_exams = pd.read_csv("StudentsPerformance.csv")

#### # Mostrar primeras 5 filas del dataframe

In [162]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

#### # Mostrar ultimas 5 filas del dataframe

In [165]:
df_exams.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

#### # Mostrar ultimas n filas del dataframe

In [166]:
df_exams.tail(3)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

#### # Accediendo al atributo shape para saber cuantas filas y columnas tiene

In [172]:
df_exams.shape

(1000, 8)

#### # Mostrar "n" filas

In [170]:
pd.set_option('display.max_rows',100)

In [171]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

# Atributos metodos y funciones basicas

## Atributos

#### # shape cuantas filas y columnas tiene el dataframe

In [176]:
df_exams.shape

(1000, 8)

#### # obteniendo acceso al atributo index

In [178]:
df_exams.index

RangeIndex(start=0, stop=1000, step=1)

#### # obteniendo columnas

In [180]:
df_exams.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

####  tipo de dato de cada columna

In [181]:
df_exams.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

## Metodos

#### # medoto head() debuelve las 5 primeas filas

In [182]:
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

##### # obtener informacion basica del dataframe

In [183]:
df_exams.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

#### # obtener valores estadisticos

In [185]:
df_exams.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

## Funciones

####  # obtener el tamaño del dataframe ( columnas )

In [186]:
len(df_exams)

1000

#### # obtener el maximo index

In [188]:
max(df_exams.index)

999

#### # obtener el min index

In [190]:
min(df_exams.index)

0

#### # obtener el tipo de dato

In [191]:
type(df_exams)

pandas.core.frame.DataFrame

#### # redondear valores del dataframe  round( dataframe, numddecimales )

In [192]:
round(df_exams,2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

#  Seleccionar 1 columna

## Syntax 1

In [1]:
import pandas as pd

In [4]:
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

####  # Seleccionar una columna con [ ] ( Forma preferida de seleccionar )

In [5]:
df_exams['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

#### # revisar el tipo de data de una columna

In [8]:
type(df_exams['gender'])

pandas.core.series.Series

#### # series: atributos y metodos

In [9]:
df_exams['gender'].index

RangeIndex(start=0, stop=1000, step=1)

In [11]:
df_exams['gender'].head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

## Syntax 2

#### # seleccionar una columna con .

In [12]:
df_exams.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

####  # seleccionar una columna con . ( errores que encontraras )

In [14]:
df_exams.math_score

AttributeError: 'DataFrame' object has no attribute 'math_score'

#### # seleccionar la misma columna con [ ]

In [15]:
df_exams['math score']

0      72
1      69
2      90
3      47
4      76
       ..
995    88
996    62
997    59
998    68
999    77
Name: math score, Length: 1000, dtype: int64

# Seleccionar dos o mas columnas de un dataframe

#### # seleccionar 2 columnas usando [[ ]]

In [16]:
df_exams[['gender','math score']]

     gender  math score
0    female          72
1    female          69
2    female          90
3      male          47
4      male          76
..      ...         ...
995  female          88
996    male          62
997  female          59
998  female          68
999  female          77

[1000 rows x 2 columns]

#### #  revisar tipo de data de la seleccion

In [17]:
type(df_exams[['gender','math score']])

pandas.core.frame.DataFrame

#### # seleccionar 2 o mas columnas usando [[ ]]

In [18]:
df_exams[['gender','math score','reading score','writing score']]

     gender  math score  reading score  writing score
0    female          72             72             74
1    female          69             90             88
2    female          90             95             93
3      male          47             57             44
4      male          76             78             75
..      ...         ...            ...            ...
995  female          88             99             95
996    male          62             55             55
997  female          59             71             65
998  female          68             78             77
999  female          77             86             86

[1000 rows x 4 columns]

# Agregar una nueva columna al dataframe

In [20]:
import pandas as pd

In [21]:
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## Agregar una nueva columna con un valor

#### # agregar una nueva columna al dataframe

In [22]:
df_exams['Lenguage Score'] = 70

In [23]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Lenguage Score
0,female,group B,bachelor's degree,standard,none,72,72,74,70
1,female,group C,some college,standard,completed,69,90,88,70
2,female,group B,master's degree,standard,none,90,95,93,70
3,male,group A,associate's degree,free/reduced,none,47,57,44,70
4,male,group C,some college,standard,none,76,78,75,70
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,70
996,male,group C,high school,free/reduced,none,62,55,55,70
997,female,group C,high school,free/reduced,completed,59,71,65,70
998,female,group D,some college,standard,completed,68,78,77,70
999,female,group D,some college,free/reduced,none,77,86,86,70

## Agregar una nueva columna con un array

####  El df tiene 1000 filas; por ello, tenemos que crear un array the 1000 elementos

#### # importar numpy

In [24]:
import numpy as np

#### # crear un array de 1000 elementos

In [28]:
language_score = np.arange(0,1000,)

#### # tamaño del array

In [27]:
len(np.arange(0,1000,))

1000

#### # agregar una nueva columna al dataframe con un array

In [29]:
df_exams['language_score'] = language_score
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Lenguage Score,language_score
0,female,group B,bachelor's degree,standard,none,72,72,74,70,0
1,female,group C,some college,standard,completed,69,90,88,70,1
2,female,group B,master's degree,standard,none,90,95,93,70,2
3,male,group A,associate's degree,free/reduced,none,47,57,44,70,3
4,male,group C,some college,standard,none,76,78,75,70,4
...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,70,995
996,male,group C,high school,free/reduced,none,62,55,55,70,996
997,female,group C,high school,free/reduced,completed,59,71,65,70,997
998,female,group D,some college,standard,completed,68,78,77,70,998
999,female,group D,some college,free/reduced,none,77,86,86,70,999

#### # crear numeros enteros aleatorios entre 1 y 1000

In [32]:
int_language_score = np.random.randint(1,100, size=1000)

#### # el minimo valor es inclusivo y el maximo valor es exclusivo

In [34]:
min(int_language_score)
max(int_language_score)

99

#### # agregar una nueva columna al dataframe con un array

In [36]:
df_exams['language_score'] = int_language_score
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Lenguage Score,language_score
0,female,group B,bachelor's degree,standard,none,72,72,74,70,76
1,female,group C,some college,standard,completed,69,90,88,70,66
2,female,group B,master's degree,standard,none,90,95,93,70,77
3,male,group A,associate's degree,free/reduced,none,47,57,44,70,53
4,male,group C,some college,standard,none,76,78,75,70,91
...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,70,95
996,male,group C,high school,free/reduced,none,62,55,55,70,26
997,female,group C,high school,free/reduced,completed,59,71,65,70,14
998,female,group D,some college,standard,completed,68,78,77,70,21
999,female,group D,some college,free/reduced,none,77,86,86,70,38

#### # crear numeros decimales aleatorios entre 1 y 1000

In [37]:
float_language_score = np.random.uniform(1,100, size=1000)

In [39]:
df_exams['language_score'] = float_language_score

In [40]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Lenguage Score,language_score
0,female,group B,bachelor's degree,standard,none,72,72,74,70,69.474973
1,female,group C,some college,standard,completed,69,90,88,70,94.165869
2,female,group B,master's degree,standard,none,90,95,93,70,55.164018
3,male,group A,associate's degree,free/reduced,none,47,57,44,70,10.297660
4,male,group C,some college,standard,none,76,78,75,70,67.172835
...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,70,46.738796
996,male,group C,high school,free/reduced,none,62,55,55,70,89.538739
997,female,group C,high school,free/reduced,completed,59,71,65,70,26.116477
998,female,group D,some college,standard,completed,68,78,77,70,97.778430
999,female,group D,some college,free/reduced,none,77,86,86,70,82.613647

# Agregar una nueva columna al df usando assign() e insert()

## assign()

### Cuando usar ?
    Agregar multiples columnas en una sola linea de codigo.
    Cuando se necesita sobreescribir los valores de una columna existente(buena practica)
    Devuelve un nuevo objeto (copia) con todas las columnas originales ademas de las nuevas

In [41]:
import numpy as np


####  # crear numeros aleatorios para nuestra nuevas columnas "score"

In [44]:
score1 = np.random.randint(1,100,size=1000)
score2 = np.random.randint(1,100,size=1000)

####  # score1

#### # crear una serie usando los numeros aleatorios

In [46]:
series1 = pd.Series(score1,index=np.arange(0,1000))
series2 = pd.Series(score2,index=np.arange(0,1000))

#### # usando assing() para agregar multiples columnas

In [51]:
df_exams = df_exams.assign(score1=series1,score2=series2)

#### # mostrar dataframe

In [52]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Lenguage Score,language_score,score1,score2
0,female,group B,bachelor's degree,standard,none,72,72,74,70,69.474973,99,92
1,female,group C,some college,standard,completed,69,90,88,70,94.165869,19,76
2,female,group B,master's degree,standard,none,90,95,93,70,55.164018,15,39
3,male,group A,associate's degree,free/reduced,none,47,57,44,70,10.297660,81,20
4,male,group C,some college,standard,none,76,78,75,70,67.172835,68,43
...,...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,70,46.738796,89,92
996,male,group C,high school,free/reduced,none,62,55,55,70,89.538739,51,80
997,female,group C,high school,free/reduced,completed,59,71,65,70,26.116477,19,15
998,female,group D,some college,standard,completed,68,78,77,70,97.778430,55,18
999,female,group D,some college,free/reduced,none,77,86,86,70,82.613647,92,42

## Insert() 
    Insertr una nueva columna en una posicion especifica o index

#### # usar insert() para adicionar una columna en una posicion especifica

In [53]:
df_exams.insert(1,'test',series1)

#### # mostrar dataframe

In [54]:
df_exams

,gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Lenguage Score,language_score,score1,score2
0,female,99,group B,bachelor's degree,standard,none,72,72,74,70,69.474973,99,92
1,female,19,group C,some college,standard,completed,69,90,88,70,94.165869,19,76
2,female,15,group B,master's degree,standard,none,90,95,93,70,55.164018,15,39
3,male,81,group A,associate's degree,free/reduced,none,47,57,44,70,10.297660,81,20
4,male,68,group C,some college,standard,none,76,78,75,70,67.172835,68,43
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,female,89,group E,master's degree,standard,completed,88,99,95,70,46.738796,89,92
996,male,51,group C,high school,free/reduced,none,62,55,55,70,89.538739,51,80
997,female,19,group C,high school,free/reduced,completed,59,71,65,70,26.116477,19,15
998,female,55,group D,some college,standard,completed,68,78,77,70,97.778430,55,18
999,female,92,group D,some college,free/reduced,none,77,86,86,70,82.613647,92,42

# Operaciones en Dataframes

In [2]:
import pandas as pd
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## Operaciones

###  Operaciones en columnas

#### # selecciona una columna y calcula la suma total

In [5]:
df_exams['math score'].sum()

66089

#### # contar, promedio, desv.estandar, maximo y minimo

In [10]:
df_exams['math score'].count()
df_exams['math score'].mean()
df_exams['math score'].std()
df_exams['math score'].max()
df_exams['math score'].min()

0

####  # calcula mas rapido con .describe()

In [11]:
df_exams.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

## Operaciones en filas

#### # calcular la suma en una fila

In [12]:
df_exams['math score']+df_exams['reading score']+df_exams['writing score']

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Length: 1000, dtype: int64

#### # calcular el score promedio y asignar los resultados a una nueva columna

In [3]:
df_exams['average'] = (df_exams['math score']+df_exams['reading score']+df_exams['writing score'])/3

####  # mostrar el dataframe

In [5]:
df_exams.round(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,average
0,female,group B,bachelor's degree,standard,none,72,72,74,72.67
1,female,group C,some college,standard,completed,69,90,88,82.33
2,female,group B,master's degree,standard,none,90,95,93,92.67
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.33
4,male,group C,some college,standard,none,76,78,75,76.33
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,94.00
996,male,group C,high school,free/reduced,none,62,55,55,57.33
997,female,group C,high school,free/reduced,completed,59,71,65,65.00
998,female,group D,some college,standard,completed,68,78,77,74.33
999,female,group D,some college,free/reduced,none,77,86,86,83.00

# El metodo value_counts()

### puede contar los elementos por categoria y tamb por porcentajes

In [60]:
import pandas as pd
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

#### # contar los elementos en la columna "gender"

####  # funcion len

In [7]:
len(df_exams['gender'])

1000

#### # metodo .count()

In [8]:
df_exams['gender'].count()

1000

#### # contar los elementos "gender" por categoria

In [9]:
df_exams['gender'].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

#### # obtener la frecuencia relativa ( dividir todos los valores entre la suma )

In [10]:
df_exams['gender'].value_counts(normalize=True)

gender
female    0.518
male      0.482
Name: proportion, dtype: float64

#### # contar elementos de la columna "parental level of education" por categoria

In [11]:
df_exams['parental level of education'].value_counts()

parental level of education
some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: count, dtype: int64

####  # obtener la frecuencia relativa y redondear a 2 decimales

In [14]:
df_exams['parental level of education'].value_counts(normalize=True).round(2)

parental level of education
some college          0.23
associate's degree    0.22
high school           0.20
some high school      0.18
bachelor's degree     0.12
master's degree       0.06
Name: proportion, dtype: float64

# Ordenar un dataframe con sort_values()

In [15]:
import pandas as pd
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

#### # ordenar por una columna

In [17]:
df_exams.sort_values(by='math score')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
59,female,group C,some high school,free/reduced,none,0,17,10
980,female,group B,high school,free/reduced,none,8,24,23
17,female,group B,some high school,free/reduced,none,18,32,28
787,female,group B,some college,standard,none,19,38,32
145,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
625,male,group D,some college,standard,completed,100,97,99
623,male,group A,some college,standard,completed,100,96,86
451,female,group E,some college,standard,none,100,92,97
962,female,group E,associate's degree,standard,none,100,100,100
149,male,group E,associate's degree,free/reduced,completed,100,100,93

#### # ordenar decendiente por una columna

In [19]:
df_exams.sort_values(by='math score',ascending=False)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
962,female,group E,associate's degree,standard,none,100,100,100
625,male,group D,some college,standard,completed,100,97,99
458,female,group E,bachelor's degree,standard,none,100,100,100
623,male,group A,some college,standard,completed,100,96,86
451,female,group E,some college,standard,none,100,92,97
...,...,...,...,...,...,...,...,...
145,female,group C,some college,free/reduced,none,22,39,33
787,female,group B,some college,standard,none,19,38,32
17,female,group B,some high school,free/reduced,none,18,32,28
980,female,group B,high school,free/reduced,none,8,24,23
59,female,group C,some high school,free/reduced,none,0,17,10

#### # orden descendiente por multiples columnas

In [20]:
df_exams.sort_values(by=['math score','reading score'],ascending=False)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
149,male,group E,associate's degree,free/reduced,completed,100,100,93
458,female,group E,bachelor's degree,standard,none,100,100,100
916,male,group E,bachelor's degree,standard,completed,100,100,100
962,female,group E,associate's degree,standard,none,100,100,100
625,male,group D,some college,standard,completed,100,97,99
...,...,...,...,...,...,...,...,...
145,female,group C,some college,free/reduced,none,22,39,33
787,female,group B,some college,standard,none,19,38,32
17,female,group B,some high school,free/reduced,none,18,32,28
980,female,group B,high school,free/reduced,none,8,24,23
59,female,group C,some high school,free/reduced,none,0,17,10

#### # orden descendiente por multiples columnas y actualizar dataframe

In [22]:
df_exams.sort_values(by=['math score','reading score'],ascending=False,inplace=True)

#### # orden descendiente con una funcion key

In [24]:
df_exams.sort_values('race/ethnicity',ascending=True,
                     key=lambda col:col.str.lower())

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
741,female,group A,associate's degree,free/reduced,none,37,57,56
151,male,group A,bachelor's degree,standard,none,77,67,68
811,male,group A,high school,free/reduced,none,45,47,49
112,male,group A,associate's degree,standard,none,54,53,47
25,male,group A,master's degree,free/reduced,none,73,74,72
...,...,...,...,...,...,...,...,...
751,male,group E,some college,standard,none,68,72,65
915,female,group E,some college,standard,none,68,70,66
592,male,group E,bachelor's degree,standard,none,68,68,64
479,male,group E,associate's degree,standard,none,76,71,67
517,female,group E,some college,standard,completed,66,74,73

# Los metodos set_index() y sort_index()

In [37]:
import numpy as np
import random

#### # crear valores no repetitivos para los index

In [38]:
new_index = np.arange(0,1000)

####  # barajar / desordenar los indeces

In [39]:
random.shuffle(new_index)
new_index

array([579, 511, 473, 658, 854, 385, 800, 493, 265, 369, 294, 645, 749,
       270, 918, 172, 421, 861, 123, 488, 723, 585, 130, 474, 447, 875,
       940, 444, 613, 528, 279, 299, 970, 724, 919, 322, 889, 764, 598,
       431, 207,  85, 571, 772, 731, 232, 914, 244, 156, 735, 942, 296,
       424, 863, 394, 326, 878,  51, 176, 801, 650, 404, 807, 374, 739,
       430, 984, 696, 759, 477, 134, 154, 195, 977, 674, 564,  92, 368,
        15, 960, 683, 964, 416, 293, 548, 974, 644, 201, 962, 972, 765,
       354, 325, 887, 689, 409, 210, 809, 747, 619,  72, 946, 453, 618,
       588,  35, 399, 532,  23, 542, 545,  60, 277, 269, 671, 400, 570,
       496, 901, 695, 103, 629, 203,  97, 688, 714, 158, 267,  21, 178,
       360, 905, 725, 152, 953, 817, 980, 248, 583, 314,  95, 933, 610,
       663, 161, 551, 691, 766, 132, 989, 415, 315, 231, 257, 458, 495,
       182, 481, 506, 518,  66, 855, 594, 184, 332, 523, 630, 767, 398,
       874, 516, 386, 871, 622, 983, 478, 367, 307,  81, 460, 577, 370,
       359, 191, 300, 114,   3, 647, 797, 241, 397, 778, 639, 281, 547,
       457,  74, 939, 335, 997, 298, 463, 382, 697, 736, 101, 403, 931,
       891, 266,  61, 576, 199, 475, 744, 833, 507, 297, 955, 440, 780,
       126, 649, 138, 324, 561, 418, 987, 530, 188, 927, 510, 165, 869,
       562, 648, 586, 273, 791, 948, 785, 537, 979, 113, 558, 555, 928,
       452, 740, 469, 734, 125, 840, 559,  96, 316, 860, 471,  24, 609,
       704, 356, 611, 278, 252, 843, 251, 679, 719, 142, 112, 624, 280,
       788, 845, 859, 604, 108, 180, 771,  86,  18, 930, 105, 540, 186,
       848, 525, 851, 938,  64, 541, 235, 290, 375,   9, 200, 694, 494,
       600, 192, 243, 492, 445, 204, 832, 702, 873, 779, 376, 750, 838,
       329, 616, 420,  17, 626, 533, 302, 661, 965,  41, 378, 209, 168,
       994, 853, 373, 446, 337, 703, 894, 291,   4, 157, 100, 727, 351,
        98, 895, 536, 162, 389, 756, 923, 776, 951, 657, 587, 116, 288,
        80, 902, 898, 466, 513, 480, 198, 909,  91, 282, 554, 841, 617,
       413, 786, 323, 943, 202, 482, 646, 794, 699, 669, 391, 468,   5,
       668, 916, 427, 171, 967, 304, 271, 514, 487, 607, 407, 449, 450,
       865, 219, 361,  22,  42, 179, 166, 886, 754, 432, 485, 729,  44,
        37, 995, 700, 712, 705,  63, 167, 589, 574, 264, 531, 155, 721,
       529, 490, 659,  26,  83, 852, 509, 174,  78,   0, 122, 733, 708,
       737, 504, 439, 947, 615, 798, 434, 684, 826, 120, 260, 606, 539,
       870, 572, 685, 240, 502, 433, 596, 789, 975, 183, 534, 344, 904,
       520, 850, 451, 770, 633, 599, 146,  40, 915, 856, 153, 381, 435,
       245,  62, 556, 726, 698, 438, 985, 608, 340, 319, 380,   7, 876,
       934,  19, 777, 115, 720, 858, 969, 543, 352, 808, 549, 664, 286,
       681, 234, 620, 276, 486, 484, 796, 275, 303, 189, 519, 388, 317,
        28, 627, 346, 949, 834, 129,  32, 592,  46, 461, 847, 462, 208,
       655, 810, 783, 816, 978, 563, 804, 921,  68,  79,  57, 595, 820,
       169, 426, 212, 912, 170, 497,  31, 342, 656, 133, 768, 802, 842,
       159, 224, 999,  14, 239, 906, 141, 175, 268, 822, 190, 544, 690,
       136, 742, 247, 828, 973,  55, 193, 365, 379, 311, 117, 308, 911,
       637, 581, 958, 339, 160, 261, 387, 505, 118, 428, 131, 991, 998,
       419, 350, 651, 110, 935, 456, 442, 959, 417, 479, 640, 149, 358,
       283,  10, 790, 614, 751, 945, 522,  13, 591, 670, 557, 732, 846,
       981, 411, 813, 966, 392, 660,  34, 289, 643, 318, 844, 890, 893,
       104, 106, 236, 707,  59, 896, 406, 137, 835, 215, 881,  30, 806,
       866, 982, 408, 259, 228, 932, 814,  16, 546, 119, 686, 849,  47,
       665, 143, 524, 761, 150, 815, 164, 372, 309,  69, 757,  70, 706,
       880, 371,  43, 910,  84, 710, 676, 253, 760, 341, 185, 194, 899,
       907, 713, 752, 177, 459, 465,  52, 498, 568,  82, 355, 722, 503,
       773, 249, 225, 567, 957, 924, 111, 632, 728, 693,  25, 552, 628,
       334, 437, 625,  38, 993, 402, 274,  33, 512, 922, 573, 917,  88,
       775, 675, 830, 377, 667, 862, 781, 837, 580, 550, 755, 666,  99,
        87, 211,  89, 621, 793,  67, 812, 884, 390, 242, 897, 412, 701,
       384, 738, 425, 483, 410,  77,  54, 925, 443, 677, 584, 383, 472,
       792, 743, 285, 753,   1, 500, 237, 787, 867,  48, 963,  53,  20,
       535, 941, 673, 748,  71, 128, 745, 908, 892, 454, 538, 226, 366,
       327, 310, 631, 107, 173, 287, 903, 349,  76, 996, 343, 888, 950,
       214,   8,  50, 829, 715,  45, 196, 362, 330, 227,  11, 217, 414,
       654, 603,  73, 758, 774, 455, 623, 956, 823, 233, 223, 393, 635,
       526, 709, 470, 944, 491, 601,  12, 569, 508, 877, 213, 263,  75,
       819, 401, 222, 364, 680, 762, 429, 811, 121, 717, 831, 284, 605,
       936, 824, 476, 553, 347, 295, 662, 784, 230, 864, 423, 306, 885,
       256, 961, 312,  39,  29, 920, 206, 527, 521, 638, 818, 292, 718,
       597,  56, 566, 147, 272, 795, 515, 255, 187, 730, 328, 929, 821,
       692, 220, 363, 499, 331,  58, 489, 900,  36, 320, 716, 353, 602,
       262, 593, 501, 464, 578, 163,   2, 348, 441, 988, 467, 827, 221,
       313, 976, 395, 805, 763,  49, 305, 197, 836, 575, 140, 205, 641,
       246,  93, 825,  94, 258, 687, 109, 872, 879, 448, 250, 422, 913,
       634, 971, 301, 652, 436, 336, 357, 799, 321, 992, 345, 590, 653,
       229, 517, 254,  27, 333, 952, 338,   6, 682, 857, 986, 151, 937,
       672, 216, 990, 148, 839, 181,  65, 102, 636, 803, 238,  90, 565,
       145, 954, 678, 582, 560, 968, 405, 782, 612, 868, 642, 139, 127,
       396, 883, 144, 218, 135, 711, 746, 926, 124, 769, 882, 741])

#### # crear una nueva columna on los nuevos index

In [40]:
df_exams['nuevo_index'] = new_index
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,nuevo_index
nuevo_index,,,,,,,,,
94,male,group E,associate's degree,free/reduced,completed,100,100,93,579
250,female,group E,bachelor's degree,standard,none,100,100,100,511
984,male,group E,bachelor's degree,standard,completed,100,100,100,473
354,female,group E,associate's degree,standard,none,100,100,100,658
702,male,group D,some college,standard,completed,100,97,99,854
...,...,...,...,...,...,...,...,...,...
35,female,group C,some college,free/reduced,none,22,39,33,926
847,female,group B,some college,standard,none,19,38,32,124
693,female,group B,some high school,free/reduced,none,18,32,28,769
12,female,group B,high school,free/reduced,none,8,24,23,882
362,female,group C,some high school,free/reduced,none,0,17,10,741

## set_index()

#### # fijar columna new_index con index

In [41]:
df_exams.set_index('nuevo_index',inplace=True)

In [42]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
nuevo_index,,,,,,,,
579,male,group E,associate's degree,free/reduced,completed,100,100,93
511,female,group E,bachelor's degree,standard,none,100,100,100
473,male,group E,bachelor's degree,standard,completed,100,100,100
658,female,group E,associate's degree,standard,none,100,100,100
854,male,group D,some college,standard,completed,100,97,99
...,...,...,...,...,...,...,...,...
926,female,group C,some college,free/reduced,none,22,39,33
124,female,group B,some college,standard,none,19,38,32
769,female,group B,some high school,free/reduced,none,18,32,28
882,female,group B,high school,free/reduced,none,8,24,23
741,female,group C,some high school,free/reduced,none,0,17,10

## sort_index()

#### # ordenar dataframe por new_index

In [48]:
df_exams.sort_index(inplace=True)
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
nuevo_index,,,,,,,,
0,female,group C,some high school,standard,none,69,73,73
1,female,group A,some college,standard,none,56,58,64
2,male,group C,associate's degree,standard,none,47,37,35
3,male,group B,associate's degree,standard,none,80,76,64
4,female,group D,associate's degree,standard,completed,73,75,80
...,...,...,...,...,...,...,...,...
995,female,group B,some high school,standard,none,70,64,72
996,male,group C,master's degree,free/reduced,none,54,59,50
997,male,group B,some high school,standard,completed,79,85,86
998,female,group C,associate's degree,standard,none,63,67,70
999,female,group B,high school,standard,none,65,64,62

#### # orden descendiente por index

In [62]:
df_exams.sort_index(ascending=True,inplace=True)
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

# Renombrar columnas e index con rename()

#### # renombrar una columna y sobreescribir los valores del dataframe

In [51]:
df_exams.rename(columns={'gender':'Gender'},inplace=True)

#### # renombrar una columna y actualizar el dataframe con el arumento inplace

In [52]:
df_exams.rename(columns={'math score':'MS',
                          'reading score':'RS',
                          'writing score':'WS'},inplace=True)

#### # mostrar dataframe

In [53]:
df_exams

,Gender,race/ethnicity,parental level of education,lunch,test preparation course,MS,RS,WS
nuevo_index,,,,,,,,
999,female,group B,high school,standard,none,65,64,62
998,female,group C,associate's degree,standard,none,63,67,70
997,male,group B,some high school,standard,completed,79,85,86
996,male,group C,master's degree,free/reduced,none,54,59,50
995,female,group B,some high school,standard,none,70,64,72
...,...,...,...,...,...,...,...,...
4,female,group D,associate's degree,standard,completed,73,75,80
3,male,group B,associate's degree,standard,none,80,76,64
2,male,group C,associate's degree,standard,none,47,37,35
1,female,group A,some college,standard,none,56,58,64
0,female,group C,some high school,standard,none,69,73,73

## Renombrar Index

#### # renombrar index 0,1,2 y actualizar el dataframe

In [64]:
df_exams.rename(index={0:'A',
                          1:'B',
                          2:'C'},inplace=True)

####  # mostrar primeras 3 filas

In [65]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
A,female,group B,bachelor's degree,standard,none,72,72,74
B,female,group C,some college,standard,completed,69,90,88
C,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86